/**
 * Namin Conventions
 * 이름을 지을때 절대적으로 지켜야하는 주의사항 4가지
 * 1) 일반적으로 영어(라틴문자)를 사용하며 문자와 숫자를 모두 사용 할 수 있다.
 * 2) 특수기호는 언더스코어와 달러만 사용 할 수 있다.
 * 3) 숫자로 이름을 시작 할 수 없다.
 * 4) 키워드는 변수명으로 사용 할 수없다.
 *  var var = 'var';  
 */

/**
 * Namin Conventions 2
 * 1) cameCase - 대부분의 언어에서 많이 사용 -> 변수이름을 만들때 주로 사용
 * 첫번째 글자 소문자로 하고 띄어쓰기 한 후 대문자 사용 -> 파일명을 정할때 주로 사용
 * 2) snake_case - 단어끼리 _로 묶는것, 파이썬같은 언어에서 사용
 * 3) PascalCase - 첫번째도 대문자로 , C# 마이크로소프트 계열의 언어에서 사용
 */

const anYuJin = '안유진';
console.log(anYuJin);